//===============================================================
// 现有画有黑线（直线或曲线）的白底图片一张，计算出有多少条黑线、并依次输出每条黑线所占的点数。
// 图片我们用0、1图表示，1代表黑点 0 代表白点，某点周围8个方向都算连通，如下图所示，共有3条黑线，长度分别是5、3、5：
// 1 0 0 0 0 0 0 
// 0 1 1 1 1 0 0
// 0 0 0 0 0 0 0
// 1 1 0 0 0 1 1
// 1 0 0 1 1 1 0
//=================================================================
#include <stdio.h>
#define M1 10
#define N1 10
int M,N;
//---------------------------------------------------------------------------------------------------函数声明
void search(int x,int y);
void start(int x);
void show();
//----------------------------------------------------------------------------------------------------全局变量定义
int a[M1][N1];
int b[M1][N1]={0};						//b[]全局变量
int line[10]={0};
int count=0,line_num=0;												//count计数已经找到的线的长度
//-----------------------------------------------------------------------------------------------------开始查找
void start1(int x,int y){
	int i,j;									
	for(i=0;i<x;i++)
		for(j=0;j<y;j++){
			if(b[i][j]==0&&a[i][j]==1){
				count=1;
				search(i,j);
				if(count>1){
					line_num++;
					line[line_num]=count;
				}
			}
		}
}//-----------------------------------------------------------------------------------定位一个点，查找四周的点
void search(int x,int y){													
	int i=x,j=y,marks=0;
	int tema,temb;
		if(a[i-1][j-1]==1 && b[i-1][j-1]!=1 && i-1>=0 && j-1>=0){
			tema=i-1;temb=j-1;
			marks++;
		}
		if(a[i-1][j]==1&&b[i-1][j]!=1&&i-1>=0){
			tema=i-1;temb=j;
			marks++;
		}
		if(a[i+1][j]==1&&b[i+1][j]!=1&&i+1<M){
			tema=i+1;
			temb=j;
			marks++;
		}
		if(a[i][j-1]==1&&b[i][j-1]!=1&&j-1>=0){
		tema=i;temb=j-1;
		marks++;
		}
		if(a[i+1][j-1]==1&&b[i+1][j-1]!=1&&i+1<M&&j-1>=0){
		tema=i+1;temb=j-1;
		marks++;
		}
		if(a[i][j+1]==1&&b[i][j+1]!=1&&j+1<N){
			tema=i;temb=j+1;
			marks++;
		}
	    if(a[i+1][j]==1&&b[i+1][j]!=1&&i+1<M){
		tema=i+1;temb=j;
		marks++;
		}
		if(a[i+1][j+1]==1&&b[i+1][j+1]!=1&&i+1<M&&j+1<N){
		tema=i+1;temb=j+1;
		marks++;
		}
		if(marks==1){
			count++;
			b[x][y]=1;
			search(tema,temb);
		}	
}//---------------------------------------------------------------------------------创建图形
void createline(){
	int i,j;
	a[0][0]=1;
  	for(i=0;i<M;i++){
	 	for(j=0;j<N;j++){
		 	scanf("%d",&a[i][j]);
		 } 
	  }
 

}//-----------------------------------------------------------------------------------------------------------输出图形函数
/*void show(){
	int i,j;
	puts("图形形状为：");
	for(i=0;i<M;i++){
		for(j=0;j<N;j++)
			printf("%d",a[i][j]);
		printf("\n");
	}
}*///------------------------------------------------------------------------------------------------------------
void main(){
	int i;

	scanf("%d%d",&N,&M); 
	createline();
	//show();
	start1(M,N);
	printf("%d\n",line_num);
	for(i=1;i<=line_num;i++)
		printf("%d\n",line[i]);
}//===========================================================
